Repository: aharotias2/passger
Catalog: po/*.po
Languages: it, ja

source: PassGer - A simple password generator
it: PassenGer - Un semplice generatore di password
ja: PassGer - 簡易なパスワード生成アプリ

source: Length:
it: Lunghezza:
ja: 文字数:

source: You can specify the password length using the spin box on the left. You can also specify the type of characters used for each character in the password using the table below. You can select the type of characters from uppercase letters, lowercase letters, numbers, and punctuation characters. You can select or deselect all character types for that column by clicking the column header. Specify at least one type for each row.
it: Puoi specificare la lunghezza della password usando la casella di selezione a sinistra. Puoi anche specificare il tipo di caratteri usato per ogni carattere nella password usando la tabella qui sotto. Puoi selezionare il tipo di caratteri da lettere maiuscole, lettere minuscole, numeri, e caratteri di punteggiatura. Puoi selezionare o deselezionare tutti i tipi di carattere per quella colonna facendo clic sull'intestazione della colonna. Specificare almeno un tipo per ogni riga.
ja: パスワードの文字数を左のスピンボタンから指定できます。 また各文字に使用する文字の種類を下の表から指定できます。 文字の種類は英大文字(ABC)、英小文字(abc)、数字(123)、記号($%&) から選択できます。 各列のヘッダーをクリックするとその列のチェックを全て選択、 または解除できます。 各行で少なくとも一つの文字種を選択してください。

source: Generate!
it: Genera!
ja: パスワード生成！

source: There is not enough characters available. Please add available characters on the right panel. Or uncheck the “Do not use duplicated characters” checkbox.
it: Non ci sono abbastanza caratteri disponibili. Aggiungi i caratteri disponibili sul pannello di destra. Oppure deseleziona la casella di controllo “Non utilizzare caratteri duplicati“.
ja: 十分に使用可能な文字がありません。 使用可能な文字を右のパネルで追加してください。 または右下の「重複する文字を使用しない」のチェックを外してください。

source: Setting is invalid. At least 1 Character should be selected on each type (upper, lower, digit, punct)
it: L'impostazione non è valida. Deve essere selezionato almeno 1 carattere per ogni tipo (maiuscolo, minuscolo, cifra, punto)
ja: 設定に謝りがあります。各グループにつき少なくとも一つの文字を選択してください。 (英大文字、英小文字、数字、記号文字)

source: At least 1 check should be checked on each rows.
it: Almeno 1 controllo deve essere verificato su ogni riga.
ja: 各行につき少なくとも一つの文字種を選択してください。

source: Character Setting
it: Impostazione del carattere
ja: 文字設定

source: Here you can specify the characters used to generate the password. The pressed characters are used to generate the password. On the contrary, the characters that are not pressed are not used for password generation. At least one character should be pressed on each category.
it: Qui puoi specificare i caratteri utilizzati per generare la password. I caratteri premuti vengono utilizzati per generare la password. Al contrario, i caratteri che non vengono premuti non vengono utilizzati per generare password. Deve essere premuto almeno un carattere su ciascuna categoria.
ja: ここではパスワード生成に使用する文字を指定できます。 押下された状態の文字はパスワードに使用されます。 反対に押下されていない状態の文字はパスワード生成に 使用されません。 グループごとに少なくとも一文字は指定してください。

source: Uppercase Letters
it: Lettere maiuscole
ja: 英大文字

source: Lowercase Letters
it: Lettere minuscole
ja: 英小文字

source: Digital characters
it: Caratteri digitali
ja: 数字

source: Punctuation Characters
it: Caratteri di punteggiatura
ja: 記号文字

source: Other Settings
it: Altre impostazioni
ja: その他の設定

source: Do not use duplicated characters
it: Non utilizzare caratteri duplicati
ja: 重複する文字を使用しない

source: Failed to open random file. exit.
it: Impossibile aprire il file casuale. Uscita.

source: IOError: random_byte was failed (%s))
it: Errore IO: random_byte non riuscito (%s))
